app/controllers/compartir_controller.rb

SELECT "videos".* FROM "videos" WHERE ( url_publica_video = 'que-tal-seria-encontrarse-con-un-chivo-viajando-en-una-mochila-en-una-moto' )
SELECT "videos".* FROM "videos"
UPDATE "videos" SET "compartido_video" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["compartido_video", 1], ["updated_at", "2015-01-11 21:49:53.618164"], ["id", 71]]
---
  def index

    @url_actual = "http://www.facebook.com/sharer.php?http://virales.rockalcayeye.info/video/" + params[:url_publica_video]



      @videoGuardado = Video.where( " url_publica_video = '" + params[:url_publica_video] + "' " )
      if not @videoGuardado.blank? then
        @videoGuardado = @videoGuardado.to_a()[0]
        @videoGuardado.update( compartido_video: @videoGuardado.compartido_video.to_i + 1 )

SELECT "videos".* FROM "videos" WHERE ( url_publica_video = 'que-tal-seria-encontrarse-con-un-chivo-viajando-en-una-mochila-en-una-moto' )
SELECT "videos".* FROM "videos"
UPDATE "videos" SET "me_gusta_video" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["me_gusta_video", 1], ["updated_at", "2015-01-11 23:16:08.842773"], ["id", 71]]
---
  def me_gusta


      @videoGuardado = Video.where( " url_publica_video = '" + params[:url_publica_video] + "' " )
      if not @videoGuardado.blank? then
        @videoGuardado = @videoGuardado.to_a()[0]
        @videoGuardado.update( me_gusta_video: @videoGuardado.me_gusta_video.to_i + 1 )

SELECT "videos".* FROM "videos" WHERE ( url_publica_video = 'que-tal-seria-encontrarse-con-un-chivo-viajando-en-una-mochila-en-una-moto' )
SELECT "videos".* FROM "videos"
UPDATE "videos" SET "no_gusta_video" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["no_gusta_video", 1], ["updated_at", "2015-01-11 23:17:44.036132"], ["id", 71]]
---
  def no_me_gusta

      @videoGuardado = Video.where( " url_publica_video = '" + params[:url_publica_video] + "' " )
      if not @videoGuardado.blank? then
        @videoGuardado = @videoGuardado.to_a()[0]
        @videoGuardado.update( no_gusta_video: @videoGuardado.no_gusta_video.to_i + 1 )