app/controllers/videos_controller.rb

  def formulario

    @mensaje_guardado = "primero debes probar el enlace de tu video para luego compartirlo con nosotros."

    @titulo_video = (params['titulo_video'].blank?) ? "" : params['titulo_video']
    @cat_video = (params['cat_video'].blank?) ? "1" : params['cat_video']
    @serv_video = (params['serv_video'].blank?) ? "YOUTUBE" : params['serv_video']
    @desc_video = (params['desc_video'].blank?) ? "" : params['desc_video']
    @url_video = (params['url_video'].blank?) ? "" : params['url_video']


  	#if not params['titulo_video'].blank? then
	  #  @titulo_video = params['titulo_video']
	  #end

    if not params['url_video'].blank? then

      @guardado = Video.where([ "servidor_video = ? and url_video = ?  ", @serv_video, @url_video ])
      if @guardado.blank? then

        @mismo_titulo = Video.where([ "url_publica_video = ?  ", convertir_url_alias( @titulo_video ) ])
        if @mismo_titulo.blank? then


            @rslCrear = Video.create({
              :categoria_video => @cat_video,
              :titulo_video => @titulo_video,
              :desc_video => @desc_video,
              :servidor_video => @serv_video,
              :url_video => @url_video,
              :url_publica_video => convertir_url_alias( @titulo_video )
            })
---
SELECT "videos".* FROM "videos" WHERE (servidor_video = NULL and url_video = 'https://www.youtube.com/watch?v=tqrtZSAriPw'  )
INSERT INTO "videos" ("titulo_video", "created_at", "updated_at") VALUES (?, ?, ?)  [["titulo_video", "xxxxx"], ["created_at", "2015-01-06 03:47:04.144531"], ["updated_at", "2015-01-06 03:47:04.144531"]]

  def todos

    @list_videos = Video.all
---
SELECT "videos".* FROM "videos"

  def presentacion

      @videoGuardado = Video.where( " url_publica_video = '" + params[:url_publica_video] + "' " )
      if not @videoGuardado.blank? then
        @videoGuardado = @videoGuardado.to_a()[0]
        @videoGuardado.update( visitas_video: @videoGuardado.visitas_video.to_i + 1 )
---
SELECT "videos".* FROM "videos" WHERE (url_publica_video = 'hombre-hace-flotar-esfera-de-metal-increíble'' )
SELECT "videos".* FROM "videos"
UPDATE "videos" SET "visitas_video" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["visitas_video", 1], ["updated_at", "2015-01-11 21:43:40.019531"], ["id", 71]]